test-results/latency-test_2026-01-06_18-23-03_log.txt
**********************
Windows PowerShell transcript start
Start time: 20260106182303
Username: DESKTOP-7F84R7K\achra
RunAs User: DESKTOP-7F84R7K\achra
Configuration Name: 
Machine: DESKTOP-7F84R7K (Microsoft Windows NT 10.0.26100.0)
Host Application: powershell
Process ID: 32092
PSVersion: 5.1.26100.7462
PSEdition: Desktop
PSCompatibleVersions: 1.0, 2.0, 3.0, 4.0, 5.0, 5.1.26100.7462
BuildVersion: 10.0.26100.7462
CLRVersion: 4.0.30319.42000
WSManStackVersion: 3.0
PSRemotingProtocolVersion: 2.3
SerializationVersion: 1.1.0.1
**********************
================================================================================
  MBCAS Latency Impact Test
  Test ID: latency-test_2026-01-06_18-23-03
================================================================================

==> Setting up namespace 'demo'...


==> Deploying Victim App (CPU-bound HTTP Server)...

[PASS] Victim API deployed

==> Deploying 7 Aggressor Pods (Stress-ng)...
  - Creating aggressor-1
  - Creating aggressor-2
  - Creating aggressor-3
  - Creating aggressor-4
  - Creating aggressor-5
  - Creating aggressor-6
  - Creating aggressor-7

==> Waiting for all pods to be READY...
[INFO] Waiting for victim-api...

[PASS] Victim API is ready
[INFO] Waiting for aggressors to schedule...
[INFO] Victim IP: 10.244.0.33

==> Starting Load Test Generator...
[INFO] Running 'hey' for 60 seconds against http://10.244.0.33:8000

  - Waiting for load test to complete (60 s)...



==> Collecting Latency Metrics...

----- LOAD TEST RESULTS -----

Summary:
  Total:	62.3007 secs
  Slowest:	7.9063 secs
  Fastest:	0.0021 secs
  Average:	0.1504 secs
  Requests/sec:	61.0106


Response time histogram:
  0.002 [1]	|
  0.793 [3738]	|ÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûáÔûá
  1.583 [19]	|
  2.373 [5]	|
  3.164 [6]	|
  3.954 [9]	|
  4.745 [6]	|
  5.535 [8]	|
  6.325 [1]	|
  7.116 [1]	|
  7.906 [5]	|


Latency distribution:
  10% in 0.0134 secs
  25% in 0.0889 secs
  50% in 0.0993 secs
  75% in 0.1070 secs
  90% in 0.1950 secs
  95% in 0.1982 secs
  99% in 2.1980 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0375 secs, 0.0021 secs, 7.9063 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0797 secs
  resp wait:	0.1113 secs, 0.0018 secs, 6.9026 secs
  resp read:	0.0014 secs, 0.0000 secs, 0.0974 secs

Status code distribution:
  [200]	3799 responses

Error distribution:
  [1]	Get http://10.244.0.33:8000: net/http: request canceled (Client.Timeout exceeded while awaiting headers)
  [1]	Get http://10.244.0.33:8000: net/http: request canceled while waiting for connection (Client.Timeout exceeded while awaiting headers)

-----------------------------
**********************
Windows PowerShell transcript end
End time: 20260106182454
**********************